CSI API ETABS v1
cPointElm.GetObj Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetObj(
	string Name,
	ref string Obj,
	ref int ObjType
)
Function GetObj (
	Name As String,
	ByRef Obj As String,
	ByRef ObjType As Integer
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim Obj As String
Dim ObjType As Integer
Dim returnValue As Integer
returnValue = instance.GetObj(Name, Obj,
	ObjType)
int GetObj(
	String^ Name,
	String^% Obj,
	int% ObjType
)
abstract GetObj :
        Name : string *
        Obj : string byref *
        ObjType : int byref -> int
Parameters
Name
Type: System.String
Obj
Type: System.String
ObjType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace